In [1]:
import numpy  as np
import pandas as pd

# Pandas Series as Scalar Value

In [2]:
a = pd.Series(data = 1)

In [3]:
a # here we can see we have an index associated with the value

0    1
dtype: int64

In [4]:
a[0] #for scalar value we passed we can access it using index name / values as series are axis label assocaited.

1

# Pandas Series as 1-D Array

In [5]:
b = pd.Series(data = [1, 2, 3, 4, 5, 6, 7])

In [6]:
b # we can see series data object has axis label associated with it.

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [7]:
b[3] # we cab access the value using index / label.

4

# Passing 2D array into Pandas Series

In [8]:
c = pd.Series(data= [[1, 2, 3], [4, 5, 6]])

In [9]:
type(c)

pandas.core.series.Series

In [10]:
c

0    [1, 2, 3]
1    [4, 5, 6]
dtype: object

In [11]:
c[0][1]

2

In [12]:
c[0]

[1, 2, 3]

In [13]:
c[1]

[4, 5, 6]

# Passing 3D array into Pandas Series

In [14]:
d = pd.Series(data= [[[1, 2, 3], [4, 5, 6]], [[7, 8, 9], [10, 11, 12]]])

In [15]:
d

0       [[1, 2, 3], [4, 5, 6]]
1    [[7, 8, 9], [10, 11, 12]]
dtype: object

In [16]:
d[0]

[[1, 2, 3], [4, 5, 6]]

In [17]:
d[0][1]

[4, 5, 6]

In [18]:
d[1][1][2]

12

In [19]:
c = pd.Series( data = [1, "a", "b", "deepak", 1.0, 2.0])

In [20]:
c

0         1
1         a
2         b
3    deepak
4         1
5         2
dtype: object

In [21]:
c[3]

'deepak'

# Passing axis lable name into Pandas Series

In [22]:
d = pd.Series(data = {"deepak": [1, 2, 3], "b" :  2})

In [23]:
type(d)

pandas.core.series.Series

In [24]:
d

deepak    [1, 2, 3]
b                 2
dtype: object

In [25]:
d["deepak"]

[1, 2, 3]

In [26]:
d.b

2

# Pandas DataFrame

In [27]:
df1 = pd.DataFrame(data=[[1, 2, 3, 4, 5, 6]], columns=["a", "b", "c", "d", "e", "f"], index = None)

In [28]:
df1

   a  b  c  d  e  f
0  1  2  3  4  5  6

In [29]:
dict1 = {"a" : 1, "b" : 2, "c" : 3, "d" : 4, "e" : 5 , "f" : 6 }

In [30]:
dict1

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5, 'f': 6}

In [31]:
dict1.keys()

dict_keys(['a', 'b', 'c', 'd', 'e', 'f'])

In [32]:
dict1.values()

dict_values([1, 2, 3, 4, 5, 6])

In [33]:
df2 = pd.DataFrame(data = [dict1.values()], columns = dict1.keys())

In [34]:
df2

   a  b  c  d  e  f
0  1  2  3  4  5  6

In [35]:
dict2 = {"a" : [1, 2, 3, 4], "b" : [5, 6, 7, 8], "c" : [9, 10, 11, 12], "d" : [13, 14, 15, 16]}

In [36]:
dict2

{'a': [1, 2, 3, 4],
 'b': [5, 6, 7, 8],
 'c': [9, 10, 11, 12],
 'd': [13, 14, 15, 16]}

In [37]:
dict2.values()

dict_values([[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [13, 14, 15, 16]])

In [38]:
df3 = pd.DataFrame(data = dict2)

In [39]:
df3

   a  b   c   d
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [40]:
dict3 = {"a" : [1, 2, 3, 4], "b" : [5, 6, 7, 8], "c" : [9, 10, 11, 12], "d" : [13, 14, 15, 16, 17]}

In [41]:
dict3

{'a': [1, 2, 3, 4],
 'b': [5, 6, 7, 8],
 'c': [9, 10, 11, 12],
 'd': [13, 14, 15, 16, 17]}

In [42]:
# df4 = pd.DataFrame(data = dict3) The array or list length must all be same.

In [43]:
df5 = pd.read_csv("./cars.csv", sep = ",")

In [44]:
df5

    USCA   US United States    809  FALSE
0  ASPAC  AUS     Australia  731.0   True
1  ASPAC  JAP         Japan  588.0   True
2  ASPAC   IN         India   18.0   True
3  ASPAC   RU        Russia  200.0  False
4  LATAM  MOR       Morocco   70.0  False
5    AFR   EG         Egypt   45.0  False
6    EUR  ENG       England    NaN   True

In [45]:
df5["USCA"].values

array(['ASPAC', 'ASPAC', 'ASPAC', 'ASPAC', 'LATAM', 'AFR', 'EUR'],
      dtype=object)

In [46]:
df6 = pd.DataFrame(data = [[1, 2, 3], [4, 5, 6]], columns = ["a", "b", "c"])

In [47]:
df6

   a  b  c
0  1  2  3
1  4  5  6

# 1st row is used as column name which is not the case

In [48]:
df6 = pd.read_csv("./cars.csv",  sep = ',', header = None)

In [49]:
df6

       0    1              2      3      4
0   USCA   US  United States  809.0  False
1  ASPAC  AUS      Australia  731.0   True
2  ASPAC  JAP          Japan  588.0   True
3  ASPAC   IN          India   18.0   True
4  ASPAC   RU         Russia  200.0  False
5  LATAM  MOR        Morocco   70.0  False
6    AFR   EG          Egypt   45.0  False
7    EUR  ENG        England    NaN   True

In [50]:
df7 = pd.read_csv("./cars.csv", sep=",", names=["a", "b", "c", "d", "e"]) # add names attribute to add column name

In [51]:
df7

       a    b              c      d      e
0   USCA   US  United States  809.0  False
1  ASPAC  AUS      Australia  731.0   True
2  ASPAC  JAP          Japan  588.0   True
3  ASPAC   IN          India   18.0   True
4  ASPAC   RU         Russia  200.0  False
5  LATAM  MOR        Morocco   70.0  False
6    AFR   EG          Egypt   45.0  False
7    EUR  ENG        England    NaN   True

In [52]:
df7["a"]

0     USCA
1    ASPAC
2    ASPAC
3    ASPAC
4    ASPAC
5    LATAM
6      AFR
7      EUR
Name: a, dtype: object

In [53]:
df7["a"].values

array(['USCA', 'ASPAC', 'ASPAC', 'ASPAC', 'ASPAC', 'LATAM', 'AFR', 'EUR'],
      dtype=object)

# Setting the Row index with a column values

In [54]:
df8 = pd.read_csv("./cars.csv", sep=",",header = None ,index_col = 1 )

In [55]:
df8

         0              2      3      4
1
US    USCA  United States  809.0  False
AUS  ASPAC      Australia  731.0   True
JAP  ASPAC          Japan  588.0   True
IN   ASPAC          India   18.0   True
RU   ASPAC         Russia  200.0  False
MOR  LATAM        Morocco   70.0  False
EG     AFR          Egypt   45.0  False
ENG    EUR        England    NaN   True

In [56]:
df8.index.name

1

# Setting the Row index with a column values and header name

In [57]:
df9 = pd.read_csv("./cars.csv", sep=",",header = None ,index_col = "a", names = ["a", "b", "c", "d", "e"] )

In [58]:
df9

         b              c      d      e
a
USCA    US  United States  809.0  False
ASPAC  AUS      Australia  731.0   True
ASPAC  JAP          Japan  588.0   True
ASPAC   IN          India   18.0   True
ASPAC   RU         Russia  200.0  False
LATAM  MOR        Morocco   70.0  False
AFR     EG          Egypt   45.0  False
EUR    ENG        England    NaN   True

In [59]:
df9.index.name

'a'

In [60]:
df9.index.name = None

In [61]:
df9

         b              c      d      e
USCA    US  United States  809.0  False
ASPAC  AUS      Australia  731.0   True
ASPAC  JAP          Japan  588.0   True
ASPAC   IN          India   18.0   True
ASPAC   RU         Russia  200.0  False
LATAM  MOR        Morocco   70.0  False
AFR     EG          Egypt   45.0  False
EUR    ENG        England    NaN   True

In [62]:
df9.columns

Index(['b', 'c', 'd', 'e'], dtype='object')

# hierarchical Indexing

In [63]:
df10 = pd.read_csv("./cars.csv", sep=",",header = None ,index_col = ["b", "a"], names = ["a", "b", "c", "d", "e"] )

In [64]:
df10

                       c      d      e
b   a
US  USCA   United States  809.0  False
AUS ASPAC      Australia  731.0   True
JAP ASPAC          Japan  588.0   True
IN  ASPAC          India   18.0   True
RU  ASPAC         Russia  200.0  False
MOR LATAM        Morocco   70.0  False
EG  AFR            Egypt   45.0  False
ENG EUR          England    NaN   True

In [65]:
df10.index

MultiIndex([( 'US',  'USCA'),
            ('AUS', 'ASPAC'),
            ('JAP', 'ASPAC'),
            ( 'IN', 'ASPAC'),
            ( 'RU', 'ASPAC'),
            ('MOR', 'LATAM'),
            ( 'EG',   'AFR'),
            ('ENG',   'EUR')],
           names=['b', 'a'])

In [66]:
df10.index.names

FrozenList(['b', 'a'])

In [67]:
df10.index.names = [None, None]

In [68]:
df10

                       c      d      e
US  USCA   United States  809.0  False
AUS ASPAC      Australia  731.0   True
JAP ASPAC          Japan  588.0   True
IN  ASPAC          India   18.0   True
RU  ASPAC         Russia  200.0  False
MOR LATAM        Morocco   70.0  False
EG  AFR            Egypt   45.0  False
ENG EUR          England    NaN   True

In [69]:
df10.columns

Index(['c', 'd', 'e'], dtype='object')

In [70]:
df10.index

MultiIndex([( 'US',  'USCA'),
            ('AUS', 'ASPAC'),
            ('JAP', 'ASPAC'),
            ( 'IN', 'ASPAC'),
            ( 'RU', 'ASPAC'),
            ('MOR', 'LATAM'),
            ( 'EG',   'AFR'),
            ('ENG',   'EUR')],
           )

In [71]:
df = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/A08MajL8qN4rq72EpVJbAP1Rw/marks_1.csv', sep = '|', header = None, names = ["Name", "Subject", "Maximun Marks", "Marks Obtained", "Percentage"])

In [72]:
df

       Name      Subject  Maximun Marks  Marks Obtained  Percentage
1    Akshay  Mathematics             50              40          80
2    Mahima      English             40              33          83
3     Vikas  Mathematics             50              42          84
4   Abhinav      English             40              31          78
5    Mahima      Science             50              40          80
6    Akshay      Science             50              49          98
7   Abhinav  Mathematics             50              47          94
8     Vikas      Science             50              40          80
9   Abhinav      Science             50              47          94
10    Vikas      English             40              39          98
11   Akshay      English             40              35          88
12   Mahima  Mathematics             50              43          86

In [73]:
df.index.name = "S.No."

In [74]:
df

          Name      Subject  Maximun Marks  Marks Obtained  Percentage
S.No.
1       Akshay  Mathematics             50              40          80
2       Mahima      English             40              33          83
3        Vikas  Mathematics             50              42          84
4      Abhinav      English             40              31          78
5       Mahima      Science             50              40          80
6       Akshay      Science             50              49          98
7      Abhinav  Mathematics             50              47          94
8        Vikas      Science             50              40          80
9      Abhinav      Science             50              47          94
10       Vikas      English             40              39          98
11      Akshay      English             40              35          88
12      Mahima  Mathematics             50              43          86

# Describing the Data

In [75]:
df11 = pd.read_excel("sales.xlsx")

In [76]:
df11

          Market             Region  No_of_Orders    Profit      Sales
0         Africa     Western Africa           251 -12901.51   78476.06
1         Africa    Southern Africa            85  11768.58   51319.50
2         Africa       North Africa           182  21643.08   86698.89
3         Africa     Eastern Africa           110   8013.04   44182.60
4         Africa     Central Africa           103  15606.30   61689.99
5   Asia Pacific       Western Asia           382 -16766.90  124312.24
6   Asia Pacific      Southern Asia           469  67998.76  351806.60
7   Asia Pacific  Southeastern Asia           533  20948.84  329751.38
8   Asia Pacific            Oceania           646  54734.02  408002.98
9   Asia Pacific       Eastern Asia           414  72805.10  315390.77
10  Asia Pacific       Central Asia            37  -2649.76    8190.74
11        Europe     Western Europe           964  82091.27  656637.14
12        Europe    Southern Europe           338  18911.49  215703.93
13        Europe    Northern Europe           367  43237.44  252969.09
14        Europe     Eastern Europe           241  25050.69  108258.93
15         LATAM      South America           496  12377.59  210710.49
16         LATAM    Central America           930  74679.54  461670.28
17         LATAM          Caribbean           288  13529.59  116333.05
18          USCA         Western US           490  44303.65  251991.83
19          USCA        Southern US           255  19991.83  148771.91
20          USCA         Eastern US           443  47462.04  264973.98
21          USCA         Central US           356  33697.43  170416.31
22          USCA             Canada            49   7246.62   26298.81

In [77]:
df12 = pd.read_excel("sales.xlsx", index_col="Region")

In [78]:
df12

                         Market  No_of_Orders    Profit      Sales
Region
Western Africa           Africa           251 -12901.51   78476.06
Southern Africa          Africa            85  11768.58   51319.50
North Africa             Africa           182  21643.08   86698.89
Eastern Africa           Africa           110   8013.04   44182.60
Central Africa           Africa           103  15606.30   61689.99
Western Asia       Asia Pacific           382 -16766.90  124312.24
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77
Central Asia       Asia Pacific            37  -2649.76    8190.74
Western Europe           Europe           964  82091.27  656637.14
Southern Europe          Europe           338  18911.49  215703.93
Northern Europe          Europe           367  43237.44  252969.09
Eastern Europe           Europe           241  25050.69  108258.93
South America             LATAM           496  12377.59  210710.49
Central America           LATAM           930  74679.54  461670.28
Caribbean                 LATAM           288  13529.59  116333.05
Western US                 USCA           490  44303.65  251991.83
Southern US                USCA           255  19991.83  148771.91
Eastern US                 USCA           443  47462.04  264973.98
Central US                 USCA           356  33697.43  170416.31
Canada                     USCA            49   7246.62   26298.81

In [79]:
df12.head()

                 Market  No_of_Orders    Profit     Sales
Region
Western Africa   Africa           251 -12901.51  78476.06
Southern Africa  Africa            85  11768.58  51319.50
North Africa     Africa           182  21643.08  86698.89
Eastern Africa   Africa           110   8013.04  44182.60
Central Africa   Africa           103  15606.30  61689.99

In [80]:
df12.head(10)

                         Market  No_of_Orders    Profit      Sales
Region
Western Africa           Africa           251 -12901.51   78476.06
Southern Africa          Africa            85  11768.58   51319.50
North Africa             Africa           182  21643.08   86698.89
Eastern Africa           Africa           110   8013.04   44182.60
Central Africa           Africa           103  15606.30   61689.99
Western Asia       Asia Pacific           382 -16766.90  124312.24
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77

In [81]:
df12.tail()

            Market  No_of_Orders    Profit      Sales
Region
Western US    USCA           490  44303.65  251991.83
Southern US   USCA           255  19991.83  148771.91
Eastern US    USCA           443  47462.04  264973.98
Central US    USCA           356  33697.43  170416.31
Canada        USCA            49   7246.62   26298.81

In [82]:
df12.info()

<class 'pandas.core.frame.DataFrame'>
Index: 23 entries, Western Africa to Canada
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Market        23 non-null     object
 1   No_of_Orders  23 non-null     int64
 2   Profit        23 non-null     float64
 3   Sales         23 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 920.0+ bytes

In [83]:
df12.describe()

       No_of_Orders        Profit          Sales
count     23.000000     23.000000      23.000000
mean     366.478261  28859.944783  206285.108696
std      246.590361  27701.193773  160589.886606
min       37.000000 -16766.900000    8190.740000
25%      211.500000  12073.085000   82587.475000
50%      356.000000  20948.840000  170416.310000
75%      479.500000  45882.845000  290182.375000
max      964.000000  82091.270000  656637.140000

In [84]:
df12.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
No_of_Orders,23.0,366.478261,246.590361,37.00,211.500,356.00,479.500,964.00
Profit,23.0,28859.944783,27701.193773,-16766.90,12073.085,20948.84,45882.845,82091.27
Sales,23.0,206285.108696,160589.886606,8190.74,82587.475,170416.31,290182.375,656637.14

In [85]:
df12

                         Market  No_of_Orders    Profit      Sales
Region
Western Africa           Africa           251 -12901.51   78476.06
Southern Africa          Africa            85  11768.58   51319.50
North Africa             Africa           182  21643.08   86698.89
Eastern Africa           Africa           110   8013.04   44182.60
Central Africa           Africa           103  15606.30   61689.99
Western Asia       Asia Pacific           382 -16766.90  124312.24
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77
Central Asia       Asia Pacific            37  -2649.76    8190.74
Western Europe           Europe           964  82091.27  656637.14
Southern Europe          Europe           338  18911.49  215703.93
Northern Europe          Europe           367  43237.44  252969.09
Eastern Europe           Europe           241  25050.69  108258.93
South America             LATAM           496  12377.59  210710.49
Central America           LATAM           930  74679.54  461670.28
Caribbean                 LATAM           288  13529.59  116333.05
Western US                 USCA           490  44303.65  251991.83
Southern US                USCA           255  19991.83  148771.91
Eastern US                 USCA           443  47462.04  264973.98
Central US                 USCA           356  33697.43  170416.31
Canada                     USCA            49   7246.62   26298.81

In [86]:
df12[0: 5]

                 Market  No_of_Orders    Profit     Sales
Region
Western Africa   Africa           251 -12901.51  78476.06
Southern Africa  Africa            85  11768.58  51319.50
North Africa     Africa           182  21643.08  86698.89
Eastern Africa   Africa           110   8013.04  44182.60
Central Africa   Africa           103  15606.30  61689.99

In [87]:
df12[5 : 11]

                         Market  No_of_Orders    Profit      Sales
Region
Western Asia       Asia Pacific           382 -16766.90  124312.24
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77
Central Asia       Asia Pacific            37  -2649.76    8190.74

# Lets index the column

In [88]:
# df12[5 : 11, 0: 1] #this is not work as arrays

In [89]:
df12[["Profit", "Sales"]]

                     Profit      Sales
Region
Western Africa    -12901.51   78476.06
Southern Africa    11768.58   51319.50
North Africa       21643.08   86698.89
Eastern Africa      8013.04   44182.60
Central Africa     15606.30   61689.99
Western Asia      -16766.90  124312.24
Southern Asia      67998.76  351806.60
Southeastern Asia  20948.84  329751.38
Oceania            54734.02  408002.98
Eastern Asia       72805.10  315390.77
Central Asia       -2649.76    8190.74
Western Europe     82091.27  656637.14
Southern Europe    18911.49  215703.93
Northern Europe    43237.44  252969.09
Eastern Europe     25050.69  108258.93
South America      12377.59  210710.49
Central America    74679.54  461670.28
Caribbean          13529.59  116333.05
Western US         44303.65  251991.83
Southern US        19991.83  148771.91
Eastern US         47462.04  264973.98
Central US         33697.43  170416.31
Canada              7246.62   26298.81

In [90]:
type(df12[["Profit", "Sales"]]) #we get pandas DataFrame

pandas.core.frame.DataFrame

In [91]:
type(df12["Profit"]) # we get pandas Series

pandas.core.series.Series

In [92]:
z = df12["Profit"]

In [93]:
z

Region
Western Africa      -12901.51
Southern Africa      11768.58
North Africa         21643.08
Eastern Africa        8013.04
Central Africa       15606.30
Western Asia        -16766.90
Southern Asia        67998.76
Southeastern Asia    20948.84
Oceania              54734.02
Eastern Asia         72805.10
Central Asia         -2649.76
Western Europe       82091.27
Southern Europe      18911.49
Northern Europe      43237.44
Eastern Europe       25050.69
South America        12377.59
Central America      74679.54
Caribbean            13529.59
Western US           44303.65
Southern US          19991.83
Eastern US           47462.04
Central US           33697.43
Canada                7246.62
Name: Profit, dtype: float64

In [94]:
z[0]

-12901.51

In [95]:
z["Eastern Europe"]

25050.69

In [96]:
df12.Profit #this will return a series

Region
Western Africa      -12901.51
Southern Africa      11768.58
North Africa         21643.08
Eastern Africa        8013.04
Central Africa       15606.30
Western Asia        -16766.90
Southern Asia        67998.76
Southeastern Asia    20948.84
Oceania              54734.02
Eastern Asia         72805.10
Central Asia         -2649.76
Western Europe       82091.27
Southern Europe      18911.49
Northern Europe      43237.44
Eastern Europe       25050.69
South America        12377.59
Central America      74679.54
Caribbean            13529.59
Western US           44303.65
Southern US          19991.83
Eastern US           47462.04
Central US           33697.43
Canada                7246.62
Name: Profit, dtype: float64

In [97]:
df12[2:5 :2 ]

                Market  No_of_Orders    Profit     Sales
Region
North Africa    Africa           182  21643.08  86698.89
Central Africa  Africa           103  15606.30  61689.99

# iloc and loc

In [98]:
df12.loc[["Western Africa" , "Western Asia"], ["Profit"]] # loc is used for actual string value of rows and columns

                  Profit
Region
Western Africa -12901.51
Western Asia   -16766.90

In [99]:
df12.iloc[0:3, 2:] # iloc is used for index value of rows and columns

                   Profit     Sales
Region
Western Africa  -12901.51  78476.06
Southern Africa  11768.58  51319.50
North Africa     21643.08  86698.89

# Conditons in dataframe

In [100]:
df12[ ["Profit"]] > 0

                   Profit
Region
Western Africa      False
Southern Africa      True
North Africa         True
Eastern Africa       True
Central Africa       True
Western Asia        False
Southern Asia        True
Southeastern Asia    True
Oceania              True
Eastern Asia         True
Central Asia        False
Western Europe       True
Southern Europe      True
Northern Europe      True
Eastern Europe       True
South America        True
Central America      True
Caribbean            True
Western US           True
Southern US          True
Eastern US           True
Central US           True
Canada               True

In [101]:
df12[ df12["Profit"] > 0 ]

                         Market  No_of_Orders    Profit      Sales
Region
Southern Africa          Africa            85  11768.58   51319.50
North Africa             Africa           182  21643.08   86698.89
Eastern Africa           Africa           110   8013.04   44182.60
Central Africa           Africa           103  15606.30   61689.99
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77
Western Europe           Europe           964  82091.27  656637.14
Southern Europe          Europe           338  18911.49  215703.93
Northern Europe          Europe           367  43237.44  252969.09
Eastern Europe           Europe           241  25050.69  108258.93
South America             LATAM           496  12377.59  210710.49
Central America           LATAM           930  74679.54  461670.28
Caribbean                 LATAM           288  13529.59  116333.05
Western US                 USCA           490  44303.65  251991.83
Southern US                USCA           255  19991.83  148771.91
Eastern US                 USCA           443  47462.04  264973.98
Central US                 USCA           356  33697.43  170416.31
Canada                     USCA            49   7246.62   26298.81

In [102]:
df12[ df12["Profit"] > 0 ].count()

Market          20
No_of_Orders    20
Profit          20
Sales           20
dtype: int64

In [103]:
df12[ (df12["Profit"] < 250000) & (df12["Market"] == "Africa") | (df12["Market"] == "Europe")]

                 Market  No_of_Orders    Profit      Sales
Region
Western Africa   Africa           251 -12901.51   78476.06
Southern Africa  Africa            85  11768.58   51319.50
North Africa     Africa           182  21643.08   86698.89
Eastern Africa   Africa           110   8013.04   44182.60
Central Africa   Africa           103  15606.30   61689.99
Western Europe   Europe           964  82091.27  656637.14
Southern Europe  Europe           338  18911.49  215703.93
Northern Europe  Europe           367  43237.44  252969.09
Eastern Europe   Europe           241  25050.69  108258.93

In [104]:
df12[(df12["Profit"] < 250000) & (df12["Market"].isin(["Africa", "Europe"]))]

                 Market  No_of_Orders    Profit      Sales
Region
Western Africa   Africa           251 -12901.51   78476.06
Southern Africa  Africa            85  11768.58   51319.50
North Africa     Africa           182  21643.08   86698.89
Eastern Africa   Africa           110   8013.04   44182.60
Central Africa   Africa           103  15606.30   61689.99
Western Europe   Europe           964  82091.27  656637.14
Southern Europe  Europe           338  18911.49  215703.93
Northern Europe  Europe           367  43237.44  252969.09
Eastern Europe   Europe           241  25050.69  108258.93

# Specail Example

In [105]:
df12

                         Market  No_of_Orders    Profit      Sales
Region
Western Africa           Africa           251 -12901.51   78476.06
Southern Africa          Africa            85  11768.58   51319.50
North Africa             Africa           182  21643.08   86698.89
Eastern Africa           Africa           110   8013.04   44182.60
Central Africa           Africa           103  15606.30   61689.99
Western Asia       Asia Pacific           382 -16766.90  124312.24
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77
Central Asia       Asia Pacific            37  -2649.76    8190.74
Western Europe           Europe           964  82091.27  656637.14
Southern Europe          Europe           338  18911.49  215703.93
Northern Europe          Europe           367  43237.44  252969.09
Eastern Europe           Europe           241  25050.69  108258.93
South America             LATAM           496  12377.59  210710.49
Central America           LATAM           930  74679.54  461670.28
Caribbean                 LATAM           288  13529.59  116333.05
Western US                 USCA           490  44303.65  251991.83
Southern US                USCA           255  19991.83  148771.91
Eastern US                 USCA           443  47462.04  264973.98
Central US                 USCA           356  33697.43  170416.31
Canada                     USCA            49   7246.62   26298.81

In [106]:
df12.iloc [ [0, 1] ]

                 Market  No_of_Orders    Profit     Sales
Region
Western Africa   Africa           251 -12901.51  78476.06
Southern Africa  Africa            85  11768.58  51319.50

In [107]:
df12.iloc[ [0,1], [0, 1, 2]]

                 Market  No_of_Orders    Profit
Region
Western Africa   Africa           251 -12901.51
Southern Africa  Africa            85  11768.58

In [108]:
df12.loc[["Southern Asia"], ["Profit"]]

                 Profit
Region
Southern Asia  67998.76

In [109]:
df12.iloc [0 : 12 ]

                         Market  No_of_Orders    Profit      Sales
Region
Western Africa           Africa           251 -12901.51   78476.06
Southern Africa          Africa            85  11768.58   51319.50
North Africa             Africa           182  21643.08   86698.89
Eastern Africa           Africa           110   8013.04   44182.60
Central Africa           Africa           103  15606.30   61689.99
Western Asia       Asia Pacific           382 -16766.90  124312.24
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77
Central Asia       Asia Pacific            37  -2649.76    8190.74
Western Europe           Europe           964  82091.27  656637.14

# Operations on DataFrame

In [110]:
df12

                         Market  No_of_Orders    Profit      Sales
Region
Western Africa           Africa           251 -12901.51   78476.06
Southern Africa          Africa            85  11768.58   51319.50
North Africa             Africa           182  21643.08   86698.89
Eastern Africa           Africa           110   8013.04   44182.60
Central Africa           Africa           103  15606.30   61689.99
Western Asia       Asia Pacific           382 -16766.90  124312.24
Southern Asia      Asia Pacific           469  67998.76  351806.60
Southeastern Asia  Asia Pacific           533  20948.84  329751.38
Oceania            Asia Pacific           646  54734.02  408002.98
Eastern Asia       Asia Pacific           414  72805.10  315390.77
Central Asia       Asia Pacific            37  -2649.76    8190.74
Western Europe           Europe           964  82091.27  656637.14
Southern Europe          Europe           338  18911.49  215703.93
Northern Europe          Europe           367  43237.44  252969.09
Eastern Europe           Europe           241  25050.69  108258.93
South America             LATAM           496  12377.59  210710.49
Central America           LATAM           930  74679.54  461670.28
Caribbean                 LATAM           288  13529.59  116333.05
Western US                 USCA           490  44303.65  251991.83
Southern US                USCA           255  19991.83  148771.91
Eastern US                 USCA           443  47462.04  264973.98
Central US                 USCA           356  33697.43  170416.31
Canada                     USCA            49   7246.62   26298.81

In [111]:
df12.Sales = df12.Sales / 1000

In [112]:
df12

                         Market  No_of_Orders    Profit      Sales
Region
Western Africa           Africa           251 -12901.51   78.47606
Southern Africa          Africa            85  11768.58   51.31950
North Africa             Africa           182  21643.08   86.69889
Eastern Africa           Africa           110   8013.04   44.18260
Central Africa           Africa           103  15606.30   61.68999
Western Asia       Asia Pacific           382 -16766.90  124.31224
Southern Asia      Asia Pacific           469  67998.76  351.80660
Southeastern Asia  Asia Pacific           533  20948.84  329.75138
Oceania            Asia Pacific           646  54734.02  408.00298
Eastern Asia       Asia Pacific           414  72805.10  315.39077
Central Asia       Asia Pacific            37  -2649.76    8.19074
Western Europe           Europe           964  82091.27  656.63714
Southern Europe          Europe           338  18911.49  215.70393
Northern Europe          Europe           367  43237.44  252.96909
Eastern Europe           Europe           241  25050.69  108.25893
South America             LATAM           496  12377.59  210.71049
Central America           LATAM           930  74679.54  461.67028
Caribbean                 LATAM           288  13529.59  116.33305
Western US                 USCA           490  44303.65  251.99183
Southern US                USCA           255  19991.83  148.77191
Eastern US                 USCA           443  47462.04  264.97398
Central US                 USCA           356  33697.43  170.41631
Canada                     USCA            49   7246.62   26.29881

In [113]:
df12.rename(columns={"Sales":   "Sales In Thousand"}) #this will create a new dataframe

                         Market  No_of_Orders    Profit  Sales In Thousand
Region
Western Africa           Africa           251 -12901.51           78.47606
Southern Africa          Africa            85  11768.58           51.31950
North Africa             Africa           182  21643.08           86.69889
Eastern Africa           Africa           110   8013.04           44.18260
Central Africa           Africa           103  15606.30           61.68999
Western Asia       Asia Pacific           382 -16766.90          124.31224
Southern Asia      Asia Pacific           469  67998.76          351.80660
Southeastern Asia  Asia Pacific           533  20948.84          329.75138
Oceania            Asia Pacific           646  54734.02          408.00298
Eastern Asia       Asia Pacific           414  72805.10          315.39077
Central Asia       Asia Pacific            37  -2649.76            8.19074
Western Europe           Europe           964  82091.27          656.63714
Southern Europe          Europe           338  18911.49          215.70393
Northern Europe          Europe           367  43237.44          252.96909
Eastern Europe           Europe           241  25050.69          108.25893
South America             LATAM           496  12377.59          210.71049
Central America           LATAM           930  74679.54          461.67028
Caribbean                 LATAM           288  13529.59          116.33305
Western US                 USCA           490  44303.65          251.99183
Southern US                USCA           255  19991.83          148.77191
Eastern US                 USCA           443  47462.04          264.97398
Central US                 USCA           356  33697.43          170.41631
Canada                     USCA            49   7246.62           26.29881

In [114]:
df12

                         Market  No_of_Orders    Profit      Sales
Region
Western Africa           Africa           251 -12901.51   78.47606
Southern Africa          Africa            85  11768.58   51.31950
North Africa             Africa           182  21643.08   86.69889
Eastern Africa           Africa           110   8013.04   44.18260
Central Africa           Africa           103  15606.30   61.68999
Western Asia       Asia Pacific           382 -16766.90  124.31224
Southern Asia      Asia Pacific           469  67998.76  351.80660
Southeastern Asia  Asia Pacific           533  20948.84  329.75138
Oceania            Asia Pacific           646  54734.02  408.00298
Eastern Asia       Asia Pacific           414  72805.10  315.39077
Central Asia       Asia Pacific            37  -2649.76    8.19074
Western Europe           Europe           964  82091.27  656.63714
Southern Europe          Europe           338  18911.49  215.70393
Northern Europe          Europe           367  43237.44  252.96909
Eastern Europe           Europe           241  25050.69  108.25893
South America             LATAM           496  12377.59  210.71049
Central America           LATAM           930  74679.54  461.67028
Caribbean                 LATAM           288  13529.59  116.33305
Western US                 USCA           490  44303.65  251.99183
Southern US                USCA           255  19991.83  148.77191
Eastern US                 USCA           443  47462.04  264.97398
Central US                 USCA           356  33697.43  170.41631
Canada                     USCA            49   7246.62   26.29881

In [115]:
df12.rename(columns={"Sales" : "Sales In Thousand"}, inplace = True) #rename will be done on same dataframe

In [116]:
df12

                         Market  No_of_Orders    Profit  Sales In Thousand
Region
Western Africa           Africa           251 -12901.51           78.47606
Southern Africa          Africa            85  11768.58           51.31950
North Africa             Africa           182  21643.08           86.69889
Eastern Africa           Africa           110   8013.04           44.18260
Central Africa           Africa           103  15606.30           61.68999
Western Asia       Asia Pacific           382 -16766.90          124.31224
Southern Asia      Asia Pacific           469  67998.76          351.80660
Southeastern Asia  Asia Pacific           533  20948.84          329.75138
Oceania            Asia Pacific           646  54734.02          408.00298
Eastern Asia       Asia Pacific           414  72805.10          315.39077
Central Asia       Asia Pacific            37  -2649.76            8.19074
Western Europe           Europe           964  82091.27          656.63714
Southern Europe          Europe           338  18911.49          215.70393
Northern Europe          Europe           367  43237.44          252.96909
Eastern Europe           Europe           241  25050.69          108.25893
South America             LATAM           496  12377.59          210.71049
Central America           LATAM           930  74679.54          461.67028
Caribbean                 LATAM           288  13529.59          116.33305
Western US                 USCA           490  44303.65          251.99183
Southern US                USCA           255  19991.83          148.77191
Eastern US                 USCA           443  47462.04          264.97398
Central US                 USCA           356  33697.43          170.41631
Canada                     USCA            49   7246.62           26.29881

In [117]:
df12.replace({"Asia Pacific" : "ASIA PACIFIC"})

                         Market  No_of_Orders    Profit  Sales In Thousand
Region
Western Africa           Africa           251 -12901.51           78.47606
Southern Africa          Africa            85  11768.58           51.31950
North Africa             Africa           182  21643.08           86.69889
Eastern Africa           Africa           110   8013.04           44.18260
Central Africa           Africa           103  15606.30           61.68999
Western Asia       ASIA PACIFIC           382 -16766.90          124.31224
Southern Asia      ASIA PACIFIC           469  67998.76          351.80660
Southeastern Asia  ASIA PACIFIC           533  20948.84          329.75138
Oceania            ASIA PACIFIC           646  54734.02          408.00298
Eastern Asia       ASIA PACIFIC           414  72805.10          315.39077
Central Asia       ASIA PACIFIC            37  -2649.76            8.19074
Western Europe           Europe           964  82091.27          656.63714
Southern Europe          Europe           338  18911.49          215.70393
Northern Europe          Europe           367  43237.44          252.96909
Eastern Europe           Europe           241  25050.69          108.25893
South America             LATAM           496  12377.59          210.71049
Central America           LATAM           930  74679.54          461.67028
Caribbean                 LATAM           288  13529.59          116.33305
Western US                 USCA           490  44303.65          251.99183
Southern US                USCA           255  19991.83          148.77191
Eastern US                 USCA           443  47462.04          264.97398
Central US                 USCA           356  33697.43          170.41631
Canada                     USCA            49   7246.62           26.29881

In [118]:
df12

                         Market  No_of_Orders    Profit  Sales In Thousand
Region
Western Africa           Africa           251 -12901.51           78.47606
Southern Africa          Africa            85  11768.58           51.31950
North Africa             Africa           182  21643.08           86.69889
Eastern Africa           Africa           110   8013.04           44.18260
Central Africa           Africa           103  15606.30           61.68999
Western Asia       Asia Pacific           382 -16766.90          124.31224
Southern Asia      Asia Pacific           469  67998.76          351.80660
Southeastern Asia  Asia Pacific           533  20948.84          329.75138
Oceania            Asia Pacific           646  54734.02          408.00298
Eastern Asia       Asia Pacific           414  72805.10          315.39077
Central Asia       Asia Pacific            37  -2649.76            8.19074
Western Europe           Europe           964  82091.27          656.63714
Southern Europe          Europe           338  18911.49          215.70393
Northern Europe          Europe           367  43237.44          252.96909
Eastern Europe           Europe           241  25050.69          108.25893
South America             LATAM           496  12377.59          210.71049
Central America           LATAM           930  74679.54          461.67028
Caribbean                 LATAM           288  13529.59          116.33305
Western US                 USCA           490  44303.65          251.99183
Southern US                USCA           255  19991.83          148.77191
Eastern US                 USCA           443  47462.04          264.97398
Central US                 USCA           356  33697.43          170.41631
Canada                     USCA            49   7246.62           26.29881

In [119]:
df12["New Porfit Column"] = df12.Profit.apply(lambda x : np.nan if x < 0 else x)

In [120]:
df12

,Market,No_of_Orders,Profit,Sales In Thousand,New Porfit Column
Region,,,,,
Western Africa,Africa,251,-12901.51,78.47606,NaN
Southern Africa,Africa,85,11768.58,51.31950,11768.58
North Africa,Africa,182,21643.08,86.69889,21643.08
Eastern Africa,Africa,110,8013.04,44.18260,8013.04
Central Africa,Africa,103,15606.30,61.68999,15606.30
Western Asia,Asia Pacific,382,-16766.90,124.31224,NaN
Southern Asia,Asia Pacific,469,67998.76,351.80660,67998.76
Southeastern Asia,Asia Pacific,533,20948.84,329.75138,20948.84
Oceania,Asia Pacific,646,54734.02,408.00298,54734.02
Eastern Asia,Asia Pacific,414,72805.10,315.39077,72805.10
Central Asia,Asia Pacific,37,-2649.76,8.19074,NaN
Western Europe,Europe,964,82091.27,656.63714,82091.27
Southern Europe,Europe,338,18911.49,215.70393,18911.49
Northern Europe,Europe,367,43237.44,252.96909,43237.44
Eastern Europe,Europe,241,25050.69,108.25893,25050.69
South America,LATAM,496,12377.59,210.71049,12377.59
Central America,LATAM,930,74679.54,461.67028,74679.54
Caribbean,LATAM,288,13529.59,116.33305,13529.59
Western US,USCA,490,44303.65,251.99183,44303.65
Southern US,USCA,255,19991.83,148.77191,19991.83
Eastern US,USCA,443,47462.04,264.97398,47462.04
Central US,USCA,356,33697.43,170.41631,33697.43
Canada,USCA,49,7246.62,26.29881,7246.62

In [121]:
df12.reset_index(inplace=True)

In [122]:
df12

,Region,Market,No_of_Orders,Profit,Sales In Thousand,New Porfit Column
0,Western Africa,Africa,251,-12901.51,78.47606,NaN
1,Southern Africa,Africa,85,11768.58,51.31950,11768.58
2,North Africa,Africa,182,21643.08,86.69889,21643.08
3,Eastern Africa,Africa,110,8013.04,44.18260,8013.04
4,Central Africa,Africa,103,15606.30,61.68999,15606.30
5,Western Asia,Asia Pacific,382,-16766.90,124.31224,NaN
6,Southern Asia,Asia Pacific,469,67998.76,351.80660,67998.76
7,Southeastern Asia,Asia Pacific,533,20948.84,329.75138,20948.84
8,Oceania,Asia Pacific,646,54734.02,408.00298,54734.02
9,Eastern Asia,Asia Pacific,414,72805.10,315.39077,72805.10
10,Central Asia,Asia Pacific,37,-2649.76,8.19074,NaN
11,Western Europe,Europe,964,82091.27,656.63714,82091.27
12,Southern Europe,Europe,338,18911.49,215.70393,18911.49
13,Northern Europe,Europe,367,43237.44,252.96909,43237.44
14,Eastern Europe,Europe,241,25050.69,108.25893,25050.69
15,South America,LATAM,496,12377.59,210.71049,12377.59
16,Central America,LATAM,930,74679.54,461.67028,74679.54
17,Caribbean,LATAM,288,13529.59,116.33305,13529.59
18,Western US,USCA,490,44303.65,251.99183,44303.65
19,Southern US,USCA,255,19991.83,148.77191,19991.83
20,Eastern US,USCA,443,47462.04,264.97398,47462.04
21,Central US,USCA,356,33697.43,170.41631,33697.43
22,Canada,USCA,49,7246.62,26.29881,7246.62

In [123]:
df12.set_index(["Market", "Region"])

                                No_of_Orders    Profit  Sales In Thousand  \
Market       Region
Africa       Western Africa              251 -12901.51           78.47606
             Southern Africa              85  11768.58           51.31950
             North Africa                182  21643.08           86.69889
             Eastern Africa              110   8013.04           44.18260
             Central Africa              103  15606.30           61.68999
Asia Pacific Western Asia                382 -16766.90          124.31224
             Southern Asia               469  67998.76          351.80660
             Southeastern Asia           533  20948.84          329.75138
             Oceania                     646  54734.02          408.00298
             Eastern Asia                414  72805.10          315.39077
             Central Asia                 37  -2649.76            8.19074
Europe       Western Europe              964  82091.27          656.63714
             Southern Europe             338  18911.49          215.70393
             Northern Europe             367  43237.44          252.96909
             Eastern Europe              241  25050.69          108.25893
LATAM        South America               496  12377.59          210.71049
             Central America             930  74679.54          461.67028
             Caribbean                   288  13529.59          116.33305
USCA         Western US                  490  44303.65          251.99183
             Southern US                 255  19991.83          148.77191
             Eastern US                  443  47462.04          264.97398
             Central US                  356  33697.43          170.41631
             Canada                       49   7246.62           26.29881

                                New Porfit Column
Market       Region
Africa       Western Africa                   NaN
             Southern Africa             11768.58
             North Africa                21643.08
             Eastern Africa               8013.04
             Central Africa              15606.30
Asia Pacific Western Asia                     NaN
             Southern Asia               67998.76
             Southeastern Asia           20948.84
             Oceania                     54734.02
             Eastern Asia                72805.10
             Central Asia                     NaN
Europe       Western Europe              82091.27
             Southern Europe             18911.49
             Northern Europe             43237.44
             Eastern Europe              25050.69
LATAM        South America               12377.59
             Central America             74679.54
             Caribbean                   13529.59
USCA         Western US                  44303.65
             Southern US                 19991.83
             Eastern US                  47462.04
             Central US                  33697.43
             Canada                       7246.62

In [133]:
df12.set_index(["Market", "Region"], inplace=True)

In [134]:
df12

                                No_of_Orders    Profit  Sales In Thousand  \
Market       Region
Africa       Western Africa              251 -12901.51           78.47606
             Southern Africa              85  11768.58           51.31950
             North Africa                182  21643.08           86.69889
             Eastern Africa              110   8013.04           44.18260
             Central Africa              103  15606.30           61.68999
Asia Pacific Western Asia                382 -16766.90          124.31224
             Southern Asia               469  67998.76          351.80660
             Southeastern Asia           533  20948.84          329.75138
             Oceania                     646  54734.02          408.00298
             Eastern Asia                414  72805.10          315.39077
             Central Asia                 37  -2649.76            8.19074
Europe       Western Europe              964  82091.27          656.63714
             Southern Europe             338  18911.49          215.70393
             Northern Europe             367  43237.44          252.96909
             Eastern Europe              241  25050.69          108.25893
LATAM        South America               496  12377.59          210.71049
             Central America             930  74679.54          461.67028
             Caribbean                   288  13529.59          116.33305
USCA         Western US                  490  44303.65          251.99183
             Southern US                 255  19991.83          148.77191
             Eastern US                  443  47462.04          264.97398
             Central US                  356  33697.43          170.41631
             Canada                       49   7246.62           26.29881

                                New Porfit Column
Market       Region
Africa       Western Africa                   NaN
             Southern Africa             11768.58
             North Africa                21643.08
             Eastern Africa               8013.04
             Central Africa              15606.30
Asia Pacific Western Asia                     NaN
             Southern Asia               67998.76
             Southeastern Asia           20948.84
             Oceania                     54734.02
             Eastern Asia                72805.10
             Central Asia                     NaN
Europe       Western Europe              82091.27
             Southern Europe             18911.49
             Northern Europe             43237.44
             Eastern Europe              25050.69
LATAM        South America               12377.59
             Central America             74679.54
             Caribbean                   13529.59
USCA         Western US                  44303.65
             Southern US                 19991.83
             Eastern US                  47462.04
             Central US                  33697.43
             Canada                       7246.62

In [136]:
df12.loc[["Africa"] , ["No_of_Orders"]]

                        No_of_Orders
Market Region
Africa Western Africa            251
       Southern Africa            85
       North Africa              182
       Eastern Africa            110
       Central Africa            103

In [137]:
df12.loc[["Africa", "Europe"] , ["No_of_Orders"]]

                        No_of_Orders
Market Region
Africa Western Africa            251
       Southern Africa            85
       North Africa              182
       Eastern Africa            110
       Central Africa            103
Europe Western Europe            964
       Southern Europe           338
       Northern Europe           367
       Eastern Europe            241

In [139]:
df12.loc[[("Africa", "Western Africa")]]

,,No_of_Orders,Profit,Sales In Thousand,New Porfit Column
Market,Region,,,,
Africa,Western Africa,251,-12901.51,78.47606,NaN

In [140]:
df12.loc[("Africa", "Western Africa")]

No_of_Orders           251.00000
Profit              -12901.51000
Sales In Thousand       78.47606
New Porfit Column            NaN
Name: (Africa, Western Africa), dtype: float64